import controller as c
c.start()

#   В репозитории оставлены 2 используемых файла CSV, 
# т.об. обечпечено сохренение копий данных, но для
# проверки , наверно, их лучше переместить или удалить.
#   Реализована сортировка, что вполне может исключить
# необходимость поиска по дате.
#   Реализован дополнительно при создании и корректировке
# заметки ввод произвольной даты, при этом время остается
# прежним, если оно было сформировано изначально.
#   Корректировка заметки позволяет вносить изменения, меняя
# только отдельные поля строки.
#   В качестве идентификатора используется индекс.